Revit 2026 API

# HardwoodHardwoodTintColor Property

---

The property labeled "Stain Color" from the "Hardwood" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static string HardwoodTintColor { get; }
```
```vb
Public Shared ReadOnly Property HardwoodTintColor As String
	Get
```
```cpp
public:
static property String^ HardwoodTintColor {
	String^ get ();
}
```
```fsharp
static member HardwoodTintColor : string with get
```

#### Property Value

String

This property is of type "AssetPropertyDoubleArray4d".

#### Reference

Hardwood Class

Autodesk.Revit.DB.Visual Namespace